<?php namespace Larabookir\Saderat\Exceptions;
/**
 * @Author     Hamed Pakdaman - pakdaman.it@gmail.com
 * @website    larabook.ir
 * @link       https://github.com/larabook/gateway/
 * @version    1.00
 */


class BankException extends \RuntimeException
{
    protected $messages = [
        -1000 => 'خطای ارتباط با بانک',
        // ---------------------------------------------------------
        1     => 'وجود خطا در فرمت اطلاعات ارسالی',
        2     => 'عدم وجود پذیرنده و ترمینال مورد درخواست در سیستم',
        3     => 'آدرس IP درخواست کننده  (پذیرنده) نامعتبر است',
        4     => 'پذیرنده موردنظر امکان استفاده از سیستم را ندارد',
        5     => 'خطا در زمان انجام درخواست',
        6     => 'خطا در پردازش درخواست',
        7     => 'امضا دیجیتال نا معتبر است',
        8     => 'شماره خرید ارائه شده توسط پذیرنده  (Invoice Number) نامعتبر است',
        9     => 'درگاه بانک در حال حاضر قادر به سرویس دهی نمی باشد',
        // ----------------------------------------------------------
        101   => 'تراکنش مورد نظر قبلا تایید شده است',
        102   => 'تراکنش مورد نظر برگشت خورده است',
        103   => 'تایید انجام نشد.',
        106   => 'پیامی از سویچی دریافت نشد',
        107   => 'تراکنش درخواستی موجود نیست',
        111   => 'مشکل در ارتباط با سوئیچ',
        112   => 'مقادیر ارسالی در درخواست معتبر نیستند.',
        113   => 'خطای سمت سرور',
    ];

    function __construct($message = null, $code = null)
    {
        if (!$message) {
            if (!isset($this->messages[ $code ]))
                $message = 'خطای ناشناخته';
            else
                $message = $this->messages[ $code ];
        }

        parent::__construct($message, intval($code));
    }
}